### AWS UAT App plan Part # 1
  #### Terraform Format and Style 🖌`success`
  #### Terraform Initialization ⚙️`success`
  #### Terraform Plan 📖`success`
  <details><summary>Show Plan</summary>
  ```

  [command]/home/runner/work/_temp/5e041e0a-977b-4ac4-8024-3b39d2852170/terraform-bin show -no-color plan.tfplan

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/About-5325ddce.js"] has changed
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "assets/About-5325ddce.js"
      + metadata               = {}
        tags                   = {
            "Bucket"          = "uat.shortpoet.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "shortpoet.com"
            "Project"         = "sp"
            "Terraform"       = "true"
        }
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/ArticleLayouts-d70ea114.js"] has changed
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "assets/ArticleLayouts-d70ea114.js"
      + metadata               = {}
        tags                   = {
            "Bucket"          = "uat.shortpoet.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "shortpoet.com"
            "Project"         = "sp"
            "Terraform"       = "true"
        }
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Articles-af0b0e6e.js"] has changed
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "assets/Articles-af0b0e6e.js"
      + metadata               = {}
        tags                   = {
            "Bucket"          = "uat.shortpoet.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "shortpoet.com"
            "Project"         = "sp"
            "Terraform"       = "true"
        }
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Landing-ad247451.css"] has changed
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "assets/Landing-ad247451.css"
      + metadata               = {}
        tags                   = {
            "Bucket"          = "uat.shortpoet.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "shortpoet.com"
            "Project"         = "sp"
            "Terraform"       = "true"
        }
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Landing-ad66df16.js"] has changed
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "assets/Landing-ad66df16.js"
      + metadata               = {}
        tags                   = {
            "Bucket"          = "uat.shortpoet.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "shortpoet.com"
            "Project"         = "sp"
            "Terraform"       = "true"
        }
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/PDF-5ddb6fa0.js"] has changed
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "assets/PDF-5ddb6fa0.js"
      + metadata               = {}
        tags                   = {
            "Bucket"          = "uat.shortpoet.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "shortpoet.com"
            "Project"         = "sp"
            "Terraform"       = "true"
        }
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Start-92288b02.js"] has changed
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "assets/Start-92288b02.js"
      + metadata               = {}
        tags                   = {
            "Bucket"          = "uat.shortpoet.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "shortpoet.com"
            "Project"         = "sp"
            "Terraform"       = "true"
        }
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/StartButtonFloat-41022946.js"] has changed
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "assets/StartButtonFloat-41022946.js"
      + metadata               = {}
        tags                   = {
            "Bucket"          = "uat.shortpoet.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "shortpoet.com"
            "Project"         = "sp"
            "Terraform"       = "true"
        }
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Terminal-b84267ff.js"] has changed
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "assets/Terminal-b84267ff.js"
      + metadata               = {}
        tags                   = {
            "Bucket"          = "uat.shortpoet.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "shortpoet.com"
            "Project"         = "sp"
            "Terraform"       = "true"
        }
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/index-b7d43fd6.js"] has changed
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "assets/index-b7d43fd6.js"
      + metadata               = {}
        tags                   = {
            "Bucket"          = "uat.shortpoet.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "shortpoet.com"
            "Project"         = "sp"
            "Terraform"       = "true"
        }
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/index.es-70f69c98.js"] has changed
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "assets/index.es-70f69c98.js"
      + metadata               = {}
        tags                   = {
            "Bucket"          = "uat.shortpoet.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "shortpoet.com"
            "Project"         = "sp"
            "Terraform"       = "true"
        }
        # (13 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.s3_object_uat.aws_s3_bucket_object.this["_headers"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "text/plain"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "_headers"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/_headers"
      + source_hash            = "8274f68f0ec4b7bd6eab988987eaf299"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["about.html"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "about.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/about.html"
      + source_hash            = "7aa400199548ff31d1bab76ed5192eb2"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["articles.html"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "articles.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/articles.html"
      + source_hash            = "6fcf0dae37fff912ded80224837b0cc9"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["articles/learning-to-unit-test-en.html"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "articles/learning-to-unit-test-en.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/articles/learning-to-unit-test-en.html"
      + source_hash            = "cbe56a4cf9e9c9aa92be748c399f98d1"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["articles/learning-to-unit-test-es.html"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "articles/learning-to-unit-test-es.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/articles/learning-to-unit-test-es.html"
      + source_hash            = "3211e2beab70b6b082c71675e8a7c0f0"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/About-5325ddce.js"] will be destroyed
  # (because key ["assets/About-5325ddce.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "private" -> null
      - bucket                 = "uat.shortpoet.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "5cbd032b29b45e1d0a6d16e96292a9fc" -> null
      - force_destroy          = true -> null
      - id                     = "assets/About-5325ddce.js" -> null
      - key                    = "assets/About-5325ddce.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/build/assets/About-5325ddce.js" -> null
      - source_hash            = "5cbd032b29b45e1d0a6d16e96292a9fc" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/About-9a2db7dc.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/About-9a2db7dc.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/About-9a2db7dc.js"
      + source_hash            = "3410d745b2a5c79b2aff8910d4e05a17"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/ArticleLayouts-be9305fd.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/ArticleLayouts-be9305fd.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/ArticleLayouts-be9305fd.js"
      + source_hash            = "c0fbf102bde80086716a75890e0d4586"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/ArticleLayouts-d70ea114.js"] will be destroyed
  # (because key ["assets/ArticleLayouts-d70ea114.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "private" -> null
      - bucket                 = "uat.shortpoet.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "60f7200ac2f35057bafcea6f92ebcae1" -> null
      - force_destroy          = true -> null
      - id                     = "assets/ArticleLayouts-d70ea114.js" -> null
      - key                    = "assets/ArticleLayouts-d70ea114.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/build/assets/ArticleLayouts-d70ea114.js" -> null
      - source_hash            = "60f7200ac2f35057bafcea6f92ebcae1" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Articles-af0b0e6e.js"] will be destroyed
  # (because key ["assets/Articles-af0b0e6e.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "private" -> null
      - bucket                 = "uat.shortpoet.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "504882fd9335a2a3e3d636628661d79a" -> null
      - force_destroy          = true -> null
      - id                     = "assets/Articles-af0b0e6e.js" -> null
      - key                    = "assets/Articles-af0b0e6e.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/build/assets/Articles-af0b0e6e.js" -> null
      - source_hash            = "504882fd9335a2a3e3d636628661d79a" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Articles-e5c4d4ef.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/Articles-e5c4d4ef.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/Articles-e5c4d4ef.js"
      + source_hash            = "ef0b55ead51771e81825455db622455f"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Landing-ad247451.css"] will be destroyed
  # (because key ["assets/Landing-ad247451.css"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "private" -> null
      - bucket                 = "uat.shortpoet.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "text/css" -> null
      - etag                   = "623d1343a7416bbbdbce909629e9939d" -> null
      - force_destroy          = true -> null
      - id                     = "assets/Landing-ad247451.css" -> null
      - key                    = "assets/Landing-ad247451.css" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/build/assets/Landing-ad247451.css" -> null
      - source_hash            = "623d1343a7416bbbdbce909629e9939d" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Landing-ad66df16.js"] will be destroyed
  # (because key ["assets/Landing-ad66df16.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "private" -> null
      - bucket                 = "uat.shortpoet.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "499bb3abadae7842e00e76ebcae1e2be" -> null
      - force_destroy          = true -> null
      - id                     = "assets/Landing-ad66df16.js" -> null
      - key                    = "assets/Landing-ad66df16.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/build/assets/Landing-ad66df16.js" -> null
      - source_hash            = "499bb3abadae7842e00e76ebcae1e2be" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Landing-c8c22ab0.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/Landing-c8c22ab0.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/Landing-c8c22ab0.js"
      + source_hash            = "23cc3960e613b43912a99fd68c72b7f0"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/PDF-19838165.css"] will be destroyed
  # (because key ["assets/PDF-19838165.css"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "private" -> null
      - bucket                 = "uat.shortpoet.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "text/css" -> null
      - etag                   = "e24945a32789e1abf50be49be251389e" -> null
      - force_destroy          = true -> null
      - id                     = "assets/PDF-19838165.css" -> null
      - key                    = "assets/PDF-19838165.css" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/build/assets/PDF-19838165.css" -> null
      - source_hash            = "e24945a32789e1abf50be49be251389e" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/PDF-5ddb6fa0.js"] will be destroyed
  # (because key ["assets/PDF-5ddb6fa0.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "private" -> null
      - bucket                 = "uat.shortpoet.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "e8004ffe09d3e370a2bf94f0fdae1cf1" -> null
      - force_destroy          = true -> null
      - id                     = "assets/PDF-5ddb6fa0.js" -> null
      - key                    = "assets/PDF-5ddb6fa0.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/build/assets/PDF-5ddb6fa0.js" -> null
      - source_hash            = "e8004ffe09d3e370a2bf94f0fdae1cf1" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/PDF-c2eec551.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/PDF-c2eec551.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/PDF-c2eec551.js"
      + source_hash            = "4d50244446fd9fd4455d79dc0acc3c85"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/PDF-ed9e0e67.css"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "text/css"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/PDF-ed9e0e67.css"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/PDF-ed9e0e67.css"
      + source_hash            = "6fc87daab214fb58303b3d530c9b2001"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Start-61a40d7f.css"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "text/css"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/Start-61a40d7f.css"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/Start-61a40d7f.css"
      + source_hash            = "4b4b60871b0c8cdca6fcf9d7e9188891"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Start-92288b02.js"] will be destroyed
  # (because key ["assets/Start-92288b02.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "private" -> null
      - bucket                 = "uat.shortpoet.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "99a701886613b4206d1454de9f1075a2" -> null
      - force_destroy          = true -> null
      - id                     = "assets/Start-92288b02.js" -> null
      - key                    = "assets/Start-92288b02.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/build/assets/Start-92288b02.js" -> null
      - source_hash            = "99a701886613b4206d1454de9f1075a2" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Start-e6442b44.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/Start-e6442b44.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/Start-e6442b44.js"
      + source_hash            = "88487daab9d84234c580b59bc34cd616"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/StartButtonFloat-41022946.js"] will be destroyed
  # (because key ["assets/StartButtonFloat-41022946.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "private" -> null
      - bucket                 = "uat.shortpoet.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "b3918b00cf6df8bf63acfab5536d284f" -> null
      - force_destroy          = true -> null
      - id                     = "assets/StartButtonFloat-41022946.js" -> null
      - key                    = "assets/StartButtonFloat-41022946.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/build/assets/StartButtonFloat-41022946.js" -> null
      - source_hash            = "b3918b00cf6df8bf63acfab5536d284f" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/StartButtonFloat-7308c767.css"] will be destroyed
  # (because key ["assets/StartButtonFloat-7308c767.css"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "private" -> null
      - bucket                 = "uat.shortpoet.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "text/css" -> null
      - etag                   = "fff573f20a9b2c51b01a41b063cbf6bd" -> null
      - force_destroy          = true -> null
      - id                     = "assets/StartButtonFloat-7308c767.css" -> null
      - key                    = "assets/StartButtonFloat-7308c767.css" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/build/assets/StartButtonFloat-7308c767.css" -> null
      - source_hash            = "fff573f20a9b2c51b01a41b063cbf6bd" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/StartNav-3edd60b6.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/StartNav-3edd60b6.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/StartNav-3edd60b6.js"
      + source_hash            = "e2437a127f4a323638f2879f50bc80e2"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/StartNav-cb1e6734.css"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "text/css"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/StartNav-cb1e6734.css"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/StartNav-cb1e6734.css"
      + source_hash            = "35bc2af385e37e6def98966cb8b61301"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Terminal-2e2ec67e.css"] will be destroyed
  # (because key ["assets/Terminal-2e2ec67e.css"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "private" -> null
      - bucket                 = "uat.shortpoet.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "text/css" -> null
      - etag                   = "85561bf1ef41088b8c3f0f50a6a1fa81" -> null
      - force_destroy          = true -> null
      - id                     = "assets/Terminal-2e2ec67e.css" -> null
      - key                    = "assets/Terminal-2e2ec67e.css" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/build/assets/Terminal-2e2ec67e.css" -> null
      - source_hash            = "85561bf1ef41088b8c3f0f50a6a1fa81" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Terminal-b84267ff.js"] will be destroyed
  # (because key ["assets/Terminal-b84267ff.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "private" -> null
      - bucket                 = "uat.shortpoet.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "767c45f65711e58cf52349c4b7a7809d" -> null
      - force_destroy          = true -> null
      - id                     = "assets/Terminal-b84267ff.js" -> null
      - key                    = "assets/Terminal-b84267ff.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/build/assets/Terminal-b84267ff.js" -> null
      - source_hash            = "767c45f65711e58cf52349c4b7a7809d" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/app-e2841901.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/app-e2841901.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/app-e2841901.js"
      + source_hash            = "0bbcf79c67dfceec92ccf526f92cac18"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/bootstrap-37892e52.css"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "text/css"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/bootstrap-37892e52.css"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/bootstrap-37892e52.css"
      + source_hash            = "4a26c11f667087bbb5a2242c131951aa"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/bootstrap.esm-695d0ac0.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/bootstrap.esm-695d0ac0.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/bootstrap.esm-695d0ac0.js"
      + source_hash            = "c4c932c880d8de73e782d1e5464dc273"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/github_profile_pic-3f4ad9de.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/github_profile_pic-3f4ad9de.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/github_profile_pic-3f4ad9de.js"
      + source_hash            = "5c3ee316aff3428460aeba1b29409701"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/index-2883df99.css"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "text/css"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/index-2883df99.css"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/index-2883df99.css"
      + source_hash            = "4936e3453a7e6bff7c1db8961e8c9697"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/index-9a0f5c31.css"] will be destroyed
  # (because key ["assets/index-9a0f5c31.css"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "private" -> null
      - bucket                 = "uat.shortpoet.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "text/css" -> null
      - etag                   = "056b4c93c0fc46fc6fee5d5c316171b9" -> null
      - force_destroy          = true -> null
      - id                     = "assets/index-9a0f5c31.css" -> null
      - key                    = "assets/index-9a0f5c31.css" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/build/assets/index-9a0f5c31.css" -> null
      - source_hash            = "056b4c93c0fc46fc6fee5d5c316171b9" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/index-b7d43fd6.js"] will be destroyed
  # (because key ["assets/index-b7d43fd6.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "private" -> null
      - bucket                 = "uat.shortpoet.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "e81f9a76dc589c96abc2896bce6fd70c" -> null
      - force_destroy          = true -> null
      - id                     = "assets/index-b7d43fd6.js" -> null
      - key                    = "assets/index-b7d43fd6.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/build/assets/index-b7d43fd6.js" -> null
      - source_hash            = "e81f9a76dc589c96abc2896bce6fd70c" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/index.es-0e5d6001.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/index.es-0e5d6001.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/index.es-0e5d6001.js"
      + source_hash            = "4641a91051f874c79d6225a8a1db0e81"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/index.es-70f69c98.js"] will be destroyed
  # (because key ["assets/index.es-70f69c98.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "private" -> null
      - bucket                 = "uat.shortpoet.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "b9e6cea64ca620c2cc6d52465f32d3c4" -> null
      - force_destroy          = true -> null
      - id                     = "assets/index.es-70f69c98.js" -> null
      - key                    = "assets/index.es-70f69c98.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/build/assets/index.es-70f69c98.js" -> null
      - source_hash            = "b9e6cea64ca620c2cc6d52465f32d3c4" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/jquery.easing-894e0459.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/jquery.easing-894e0459.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/jquery.easing-894e0459.js"
      + source_hash            = "c1039c71154f67b886d5d2b3dc629a0e"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/recase-24e0a860.js"] will be destroyed
  # (because key ["assets/recase-24e0a860.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "private" -> null
      - bucket                 = "uat.shortpoet.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "d8e1c611a6581a7685243e68e0fdbaa1" -> null
      - force_destroy          = true -> null
      - id                     = "assets/recase-24e0a860.js" -> null
      - key                    = "assets/recase-24e0a860.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/build/assets/recase-24e0a860.js" -> null
      - source_hash            = "d8e1c611a6581a7685243e68e0fdbaa1" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.shortpoet.com"
 
  ```
  </details>
  *Pusher: @shortpoet, Action: `pull_request`, Working Directory: ``, Workflow: `App Infra`*